docs/java.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>java</title>
<!-- 2017-04-27 四 22:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="lumen" />
</head>
<body>
<div id="content">
<h1 class="title">java</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. JVM</a></li>
<li><a href="#sec-2">2. JVM Memory Structure</a></li>
<li><a href="#sec-3">3. java.lang.UnsupportedClassVersionError: Unsupported major.minor version</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> JVM</h2>
<div class="outline-text-2" id="text-1">
<p>
Java Virtual Machine 实现了java语言最重要的特征：平台无关性
JVM屏蔽了与具体平台相关的信息，使Java语言编译程序只需要生成在JVM上运行的目标字节码（.class）,就可以在多种平台上不加修改地运行。Java 虚拟机在执行字节码时，把字节码解释成具体平台上的机器指令执行。因此实现java平台无关性。
JVM 是 编译后的 Java 程序（.class文件）和硬件系统之间的接口 
JVM = 类加载器 classloader + 执行引擎 execution engine + 运行时数据区域 runtime data area
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> JVM Memory Structure</h2>
<div class="outline-text-2" id="text-2">
<p>
1）pc 寄存器
2）JVM 栈
3）堆（Heap）
4）方法区（Method Area）
5）运行时常量池（Runtime Constant Pool）
6）本地方法栈（Native Method Stacks）
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> java.lang.UnsupportedClassVersionError: Unsupported major.minor version</h2>
<div class="outline-text-2" id="text-3">
<p>
原因： jar包编译版本高于本地jre版本
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: lumen</p>
<p class="date">Created: 2017-04-27 四 22:10</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
